## is_unique - Axis Indexes with Duplicate Labels

In [1]:
# pd.Index.is_unique?

In [2]:
import pandas as pd
import numpy as np

di_s = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
di_s['a']
# di_s['b']

a    0
a    1
dtype: int64

In [3]:
di_s.index.is_unique

False

In [4]:
df11 = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df11.loc['a']

          0         1         2
a -0.438207  0.876985 -0.650467
a -1.204302  0.165004 -0.149079

In [5]:
df11.index.is_unique

False

## unique - Unique Values, Value Counts, and Membership

In [6]:
import pandas as pd
ser_u = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
ser_u

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [7]:
ser_u.unique()
# ser_u.value_counts()
# ser_u[ser_u.isin(['d', 'c'])]

array(['c', 'a', 'd', 'b'], dtype=object)

In [8]:
n_dist = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
dist = pd.Series(['c', 'b', 'a'])

pd.Index(dist).get_indexer(n_dist)

array([0, 2, 1, 1, 0, 2])

In [9]:
df13 = pd.DataFrame({'Qu1': [1, 3, 4, 3], 'Qu2': [2, 3, 1, 2], 'Qu3': [1, 5, 2, 4]})
histogram = df13.apply(pd.value_counts)
histogram

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  1.0  NaN
4  1.0  NaN  1.0
5  NaN  NaN  1.0

In [10]:
histogram = df13.apply(pd.value_counts).fillna(0)
histogram

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  1.0  0.0
4  1.0  0.0  1.0
5  0.0  0.0  1.0

## Project

In [11]:
import pandas as pd
cars=pd.read_csv('input/cars.csv')
cars.head()

,name,sports_car,suv,wagon,minivan,pickup,all_wheel,rear_wheel,Price,Dealer_Cost,Engine_size,cylenders,horsepower,city_miles_per_galloon,highway_miles_per_Gallon,weight,base_wheeel,length,width
0,Chevrolet Aveo 4dr,False,False,False,False,False,False,False,11690,10965,1.6,4,103,28.0,34.0,2370.0,98.0,167.0,66.0
1,Chevrolet Aveo LS 4dr hatch,False,False,False,False,False,False,False,12585,11802,1.6,4,103,28.0,34.0,2348.0,98.0,153.0,66.0
2,Chevrolet Cavalier 2dr,False,False,False,False,False,False,False,14610,13697,2.2,4,140,26.0,37.0,2617.0,104.0,183.0,69.0
3,Chevrolet Cavalier 4dr,False,False,False,False,False,False,False,14810,13884,2.2,4,140,26.0,37.0,2676.0,104.0,183.0,68.0
4,Chevrolet Cavalier LS 2dr,False,False,False,False,False,False,False,16385,15357,2.2,4,140,26.0,37.0,2617.0,104.0,183.0,69.0

In [21]:
# How many unique numbers of cylinders we have in the cars dataset?
cars.cylenders.value_counts()

 6     190
 4     136
 8      87
 5       7
 12      3
 10      2
-1       2
 3       1
Name: cylenders, dtype: int64

In [22]:
cars.cylenders.unique()

array([ 4,  6,  3,  8,  5, 12, 10, -1])

In [23]:
# what is the average horsepower of cars? 
cars.horsepower.describe()

count    428.000000
mean     215.885514
std       71.836032
min       73.000000
25%      165.000000
50%      210.000000
75%      255.000000
max      500.000000
Name: horsepower, dtype: float64

In [24]:
# what is the most expensive car?
cars[cars.Price== max(cars.Price)]

,car_name,sports_car,suv,wagon,minivan,pickup,all_wheel,rear_wheel,Price,Dealer_Cost,Engine_size,cylenders,horsepower,city_miles_per_galloon,highway_miles_per_Gallon,weight,base_wheeel,length,width
287,Porsche 911 GT2 2dr,True,False,False,False,False,False,True,192465,173560,3.6,6,477,17.0,24.0,3131.0,93.0,175.0,72.0

In [25]:
# change the name of the column "name" to "car name"
cars= cars.rename(columns= {'name': 'car_name'})

In [17]:
# make a subset of the data that has the car name, the price and name the new sub-setted data frame  car pricing.
cars_pricing= cars[['car_name','Price']]

In [18]:
# create a function called pricing category that returns "Budget Car " if the cars are less than 20,000 USD," 
# Suitable Car " is the car is more than 20,000 and less than 35 000 and more than 35000. 

def pricing_category(price):
    if( price < 20000):
        a= 'Budget Car'
    if((price>= 20000)&(price<= 35000)):
        a= 'Suitable Car'
    if(price >35000):
        a= 'Expensive Car'
    return a

pricing_category(55000)

'Expensive Car'

In [26]:
# create a column named category on the subset using a for loop and pricing category function.

cars_pricing['category']='NA'
for i in range(cars_pricing.shape[0]):
    cars_pricing.category[i]= pricing_category(cars_pricing.Price[i])

/var/folders/9q/486czkcn7lv5v0hwbt71twdc0000gn/T/ipykernel_14485/193799254.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars_pricing.category[i]= pricing_category(cars_pricing.Price[i])

In [28]:
# How many Budget cars, suitable cars, and expensive cars we have?

cars_pricing.category.value_counts()

Suitable Car     193
Expensive Car    137
Budget Car        98
Name: category, dtype: int64